# Miscellaneous

## Read documentation
### Google what you want and go to the result according to your version 
### [Pandas API](https://pandas.pydata.org/pandas-docs/stable/reference/index.html)

In [1]:
import pandas as pd

In [2]:
ufo=pd.read_csv('http://bit.ly/uforeports')

In [3]:
pd.isnull(ufo).head()

    City  Colors Reported  Shape Reported  State   Time
0  False             True           False  False  False
1  False             True           False  False  False
2  False             True           False  False  False
3  False             True           False  False  False
4  False             True           False  False  False

In [4]:
ufo.isnull().head()

    City  Colors Reported  Shape Reported  State   Time
0  False             True           False  False  False
1  False             True           False  False  False
2  False             True           False  False  False
3  False             True           False  False  False
4  False             True           False  False  False

In [5]:
ufo.sample(n=3)

                City Colors Reported Shape Reported State             Time
5696    Indianapolis             RED          LIGHT    IN    8/1/1987 0:00
2750   North Windham             NaN           DISK    ME   8/23/1974 2:30
14964   Cedar Rapids             NaN       TEARDROP    IA  10/28/1999 4:47

In [6]:
ufo.sample(n=3,random_state=42)

               City Colors Reported Shape Reported State              Time
217    Norridgewock             NaN           DISK    ME   9/15/1952 14:00
12282         Ipava             NaN       TRIANGLE    IL   10/1/1998 21:15
17933     Ellinwood             NaN       FIREBALL    KS  11/13/2000 22:00

In [7]:
ufo.sample(n=3,random_state=42)

               City Colors Reported Shape Reported State              Time
217    Norridgewock             NaN           DISK    ME   9/15/1952 14:00
12282         Ipava             NaN       TRIANGLE    IL   10/1/1998 21:15
17933     Ellinwood             NaN       FIREBALL    KS  11/13/2000 22:00

In [8]:
ufo.sample(frac=0.25,random_state=53)

              City Colors Reported Shape Reported State              Time
5974     Charlotte           GREEN       TRIANGLE    MI  10/17/1988 23:00
13556         Troy             NaN          CIGAR    OH   5/27/1999 13:45
2284       Wayland             NaN          LIGHT    MA   7/21/1972 22:00
8143   East Aurora             NaN            NaN    IL   5/24/1995 21:00
15604         Keys             NaN        VARIOUS    CA  12/31/1999 23:48
...            ...             ...            ...   ...               ...
7283      Whittier             NaN         CIRCLE    CA   3/10/1994 18:00
14769   Munds Park             NaN           CONE    AZ   10/8/1999 21:00
13944   Naperville             NaN          LIGHT    IL    7/15/1999 2:00
2566          Kent             NaN          CIGAR    WA     1/1/1974 1:00
1518     Chiloquin             NaN           DISK    OR   9/15/1967 19:30

[4560 rows x 5 columns]

In [9]:
train=ufo.sample(frac=0.25,random_state=53)

In [10]:
test=ufo.loc[~ufo.index.isin(train.index),:]

In [11]:
test

                 City Colors Reported Shape Reported State              Time
0              Ithaca             NaN       TRIANGLE    NY    6/1/1930 22:00
1         Willingboro             NaN          OTHER    NJ   6/30/1930 20:00
2             Holyoke             NaN           OVAL    CO   2/15/1931 14:00
3             Abilene             NaN           DISK    KS    6/1/1931 13:00
5         Valley City             NaN           DISK    ND   9/15/1934 15:30
...               ...             ...            ...   ...               ...
18235  Fountain Hills             NaN            NaN    AZ  12/31/2000 23:00
18236      Grant Park             NaN       TRIANGLE    IL  12/31/2000 23:00
18237     Spirit Lake             NaN           DISK    IA  12/31/2000 23:00
18238     Eagle River             NaN            NaN    WI  12/31/2000 23:45
18240            Ybor             NaN           OVAL    FL  12/31/2000 23:59

[13681 rows x 5 columns]